LP0204/esp32s3-omni-car-course-design/camera-sensor-display/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# UART0 connects to the on-board CH340. GPIO19/20 are reserved for the UVC
# camera, so the USB Serial/JTAG console must not be selected.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ESP32-S3-WROOM-2 octal PSRAM is required by USB UVC frame buffers and JPEG
# decoding. Preserve enough internal RAM for USB transfers.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=120000

# JQ-CAM12 MJPEG frames may omit the Huffman table. Decode them in software.
CONFIG_JD_USE_ROM=n
CONFIG_JD_DEFAULT_HUFFMAN=y

# The camera's composite USB descriptor exceeds ESP-IDF's 256-byte default.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048

# Print the descriptor once if UVC format parsing needs diagnosis.
CONFIG_UVC_PRINTF_CONFIGURATION_DESCRIPTOR=y
